In [5]:
import pandas as pd
# Read the CSV file into a DataFrame
df = pd.read_csv('healthcare_dataset.csv')
df.head()

,Name,Age,Gender,Blood Type,Medical Condition,Date of Admission,Doctor,Hospital,Insurance Provider,Billing Amount,Room Number,Admission Type,Discharge Date,Medication,Test Results
0,Tiffany Ramirez,81,Female,O-,Diabetes,11/17/2022,Patrick Parker,Wallace-Hamilton,Medicare,37490.98336,146,Elective,12/1/2022,Aspirin,Inconclusive
1,Ruben Burns,35,Male,O+,Asthma,6/1/2023,Diane Jackson,"Burke, Griffin and Cooper",UnitedHealthcare,47304.06485,404,Emergency,6/15/2023,Lipitor,Normal
2,Chad Byrd,61,Male,B-,Obesity,1/9/2019,Paul Baker,Walton LLC,Medicare,36874.89700,292,Emergency,2/8/2019,Lipitor,Normal
3,Antonio Frederick,49,Male,B-,Asthma,5/2/2020,Brian Chandler,Garcia Ltd,Medicare,23303.32209,480,Urgent,5/3/2020,Penicillin,Abnormal
4,Mrs. Brandy Flowers,51,Male,O-,Arthritis,7/9/2021,Dustin Griffin,"Jones, Brown and Murray",UnitedHealthcare,18086.34418,477,Urgent,8/2/2021,Paracetamol,Normal

In [6]:
import pandas as pd
# Create a Series from a list
data = [10, 20, 30, 40, 50]
s = pd.Series(data)
print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [11]:
print(s.iloc[3]) # Access the element at position 3 (value 40)

40

In [12]:
print(s[1:4])   # Access a range of elements by label

1    20
2    30
3    40
dtype: int64

In [15]:
s.mean()

np.float64(30.0)

In [8]:
liverpool = ['Alison', 'Salah', 'VanDirk', 'Konate', 'Arne', 'Flirt']
lp = pd.Series(liverpool)
lp

0     Alison
1      Salah
2    VanDirk
3     Konate
4       Arne
5      Flirt
dtype: object

In [10]:
pd.Series(lp[2])

0    VanDirk
dtype: object

In [16]:
import pandas as pd
# Creating a DataFrame from a dictionary
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 28],
        'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(data)
print(df)

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

In [17]:
print(df['Name'])  # Access the 'Name' column

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [21]:
pd.Serie(df.iloc[2]) # Access the third row by positio

Name        Charlie
Age              35
City    Los Angeles
Name: 2, dtype: object

In [22]:
print(df.iloc[2])

Name        Charlie
Age              35
City    Los Angeles
Name: 2, dtype: object

In [23]:
print(df.loc[1])  # Access the second row by label

Name              Bob
Age                30
City    San Francisco
Name: 1, dtype: object

In [39]:
print(df)

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

In [38]:
print(df.iloc[2])   # Access the third row by position
print(df.loc[1])    # Access the second row by label

Name        Charlie
Age              35
City    Los Angeles
Name: 2, dtype: object
Name              Bob
Age                30
City    San Francisco
Name: 1, dtype: object

In [40]:
print(df.loc[2])

Name        Charlie
Age              35
City    Los Angeles
Name: 2, dtype: object

In [41]:
print(df.iloc[2])

Name        Charlie
Age              35
City    Los Angeles
Name: 2, dtype: object

In [24]:
print(df[['Name', 'Age']]) # Select specific columns

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   28

In [48]:
print(df[1:2 :1])             # Select specific rows

  Name  Age           City
1  Bob   30  San Francisco